Revit 2027 API
IFCData.Inequality Operator
Determines whether two IFCDatas are different.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator !=(
	IFCData first,
	IFCData second
)
Public Shared Operator <> (
	first As IFCData,
	second As IFCData
) As Boolean
public:
static bool operator !=(
	IFCData^ first,
	IFCData^ second
)
static let inline (<>)
        first : IFCData *
        second : IFCData  : bool
Parameters
first IFCData
The first IFCData.
second IFCData
The second IFCData.
Return Value
Boolean
True if the IFCDatas are different; otherwise, false.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace